Repository: carlosparra1998/my_portfolio
Catalog: lib/l10n/intl_*.arb
Languages: es

source: Spanish
es: Español

source: English
es: Inglés

# job
source: SENIOR FRONTEND DEVELOPER
es: DESARROLLADOR SENIOR FRONTEND

# phrase
source: "The only way to predict the future is to implement it"
es: "La única forma de predecir el futuro es implementarlo"

# download
source: DOWNLOAD CV
es: DESCARGAR CV

source: Awards
es: Premios

source: About me
es: Acerca de mí

# description
source: I was born in the city of Albacete, where I obtained my degree in Computer Engineering at the University of Castilla-La Mancha in 2022. There I was awarded with the prize for the most innovative Final Degree Project by the Campollano Foundation (2022). Professional in front-end development since 2020, specialized in Flutter and the Android/iOS ecosystem. I have extensive experience using programming languages such as Dart and Kotlin, and I consistently apply Clean Code principles and scalable architectures like MVVM and Clean Architecture. I also master different levels of testing in Flutter, including unit, widget, and integration tests, ensuring the quality and stability of the applications I build. In my day-to-day role as a senior front-end developer, I design and develop high-performance mobile and web applications, using state management solutions such as Provider, BLoC, and Cubit, as well as other advanced practices in modern Flutter development. I have also contributed to the open-source ecosystem by developing packages published on pub.dev. In addition to my work as a front-end developer, I am the founder and organizer of Flutter Murcia, a local community created to share knowledge and connect developers in the region who are interested in Flutter. I have participated as a speaker in events such as #FlutterInProductionExtended by Flutter Málaga, and in the workshop “Learn to Use Flutter and Build Cross-Platform Apps,” organized by CEEIM and MurciaDev.
es: Nací en la ciudad de Albacete, en donde obtuve mi título de Ingeniero Informático en la Universidad de Castilla-La Mancha en 2022. En ella fui galardonado con el premio al Trabajo de Fin de Grado más innovador por parte de la Fundación Campollano (2022). Profesional en desarrollo front-end desde 2020, especializado en Flutter y el ecosistema Android/iOS. Tengo amplia experiencia utilizando lenguajes de programación como Dart y Kotlin, y aplico de manera constante los principios de Clean Code y arquitecturas escalables como MVVM y Clean Architecture. También domino distintos niveles de pruebas en Flutter, incluyendo tests unitarios, de widgets e integración, garantizando la calidad y estabilidad de las aplicaciones que desarrollo. En mi trabajo diario como desarrollador front-end senior, diseño y desarrollo aplicaciones móviles y web de alto rendimiento, utilizando soluciones de gestión de estado como Provider, BLoC y Cubit, así como otras prácticas avanzadas en el desarrollo moderno con Flutter. También he contribuido al ecosistema de código abierto desarrollando paquetes publicados en pub.dev. Además de mi labor como desarrollador front-end, soy fundador y organizador de Flutter Murcia, una comunidad local creada para compartir conocimiento y conectar a desarrolladores de la región interesados en Flutter. He participado como ponente en eventos como #FlutterInProductionExtended organizado por Flutter Málaga, y en el taller “Aprende a usar Flutter y crea aplicaciones multiplataforma”, organizado por CEEIM y MurciaDev.

# tech
source: Technologies used
es: Tecnologías utilizadas

# workShow
source: In this section I will present the GitHub repositories of my main personal projects.
es: En esta sección presentaré los repositorios de GitHub de mis principales proyectos personales.

# finalPhrase
source: Powered by Flutter
es: Desarrollado con Flutter

source: ADDRESS
es: DIRECCIÓN

# getCountry
source: Spain
es: España

# phone
source: PHONE NUMBER
es: TELÉFONO

# mobileDev
source: Mobile development
es: Desarrollo móvil

# otherTech
source: Other technologies
es: Otras tecnologías

source: Explore more
es: Explora más

# tfgAwardTitle
source: Campollano Foundation's most innovative Final Degree Project (TFG) 2021-2022
es: Trabajo Fin de Grado (TFG) más innovador 2021-2022 de la Fundación Campollano

# appFlutter
source: Flutter App
es: Aplicación Flutter

# appPython
source: Python Service
es: Servicio Python

# myPersonalTasksDescriptionProject
source: Application developed in Flutter for managing user tasks. The design pattern followed has been Model View View-Model (MVVM), in which we have incorporated the functionality of Provider to manage the states of the app.
es: Aplicación desarrollada en Flutter para la gestión de tareas del usuario. El patrón de diseño seguido ha sido Model View View-Model (MVVM), en la cual hemos incorporado la funcionalidad de Provider para manejar los estados de la app.

# wsDescriptionProject
source: Application developed in Flutter for the management of favorite movies of Wembley Studios employees. The design pattern followed has been Model View View-Model (MVVM), in which we have incorporated the functionality of Provider to manage the states of the app.
es: Aplicación desarrollada en Flutter para la gestión de películas favoritas de los empleados de Wembley Studios. El patrón de diseño seguido ha sido Model View View-Model (MVVM), en la cual hemos incorporado la funcionalidad de Provider para manejar los estados de la app.

# faClientDescriptionProject
source: This is the implementation of the client's mobile application, corresponding to the FaceAccess system.
es: Esta es la implementación de la aplicación móvil del cliente, correspondiente al sistema FaceAccess.

# faEmployeeDescriptionProject
source: This is the implementation of the employee's mobile application, corresponding to the FaceAccess system.
es: Esta es la implementación de la aplicación móvil del empleado, correspondiente al sistema FaceAccess.

# faServerDescriptionProject
source: This project corresponds to the backend of the service for the operation of the FaceAccess access control system.
es: Este proyecto corresponde con el backend del servicio para el funcionamiento del sistema de control de acceso FaceAccess.

# taller29FrontTitleProject
source: FLUTTER WORKSHOP 29/05/2024 - FRONTEND
es: TALLER FLUTTER 29/05/2024 - FRONTEND

# taller29FrontDescriptionProject
source: Final project (frontend part) corresponding to the Flutter workshop given by me at the Centro de Empresas e Innovación de Murcia on 05/29/2024. In this project a monolithic TODO LIST has been developed.
es: Proyecto final (parte frontend) correspondiente al taller de Flutter impartido por mí en el Centro de Empresas e Innovación de Murcia el día 29/05/2024. En este proyecto se ha desarrollado un TODO LIST monolítico.

# taller29BackTitleProject
source: FLUTTER WORKSHOP 29/05/2024 - BACKEND
es: TALLER FLUTTER 29/05/2024 - BACKEND

# taller29BackDescriptionProject
source: Final project (backend part) corresponding to the Flutter workshop given by me at the Centro de Empresas e Innovación de Murcia on 05/29/2024. In this project we have developed everything necessary for API communication and persistence in DB of the TODOs.
es: Proyecto final (parte backend) correspondiente al taller de Flutter impartido por mí en el Centro de Empresas e Innovación de Murcia el día 29/05/2024. En este proyecto se ha desarrollado todo lo necesario para la comunicación API y persistencia en BBDD de los TODOs.

# seeGithub
source: SEE IN GITHUB
es: VER EN GITHUB

# seeGooglePlay
source: SEE IN GOOGLE PLAY
es: VER EN GOOGLE PLAY

# seePubDev
source: SEE IN PUB.DEV
es: VER EN PUB.DEV

# flutterLibrary
source: Flutter Library - Pub.dev
es: Librería Flutter - Pub.dev

source: Projects
es: Proyectos

# experienceInYears
source: Years Experience
es: Años Experiencia

# fluencyPathDesc
source: With our app, you can successfully prepare for your English certification exam in a simple and effective way. In it, you will find exercises of different styles.
es: Con nuestra aplicación, podrás preparar con éxito tu examen de certificación de Inglés de una forma sencilla y eficaz. En ella podrás encontrar ejercicios de diferentes estilos.

# deepObserverDesc
source: Library that enables simple and efficient management of application responsiveness in Flutter.
es: Biblioteca que permite una gestión simple y eficiente de la reactividad de la aplicación en Flutter.

# flutterFullLayoutDesc
source: CLI to generate a complete Flutter project with CLEAN ARCHITECTURE. It will allow the developer to create a base project with CLEAN ARCHITECTURE. In this architecture, we use services (Cubits) for each use case. These services will communicate with repositories (for each use case), and these repositories will communicate with the DIO client (HTTP).
es: CLI para generar un proyecto Flutter completo con ARQUITECTURA LIMPIA. Permitirá al desarrollador crear un proyecto base con ARQUITECTURA LIMPIA. En esta arquitectura, utilizamos servicios (Cubits) para cada caso de uso. Estos servicios se comunicarán con repositorios (para cada caso de uso), y estos repositorios se comunicarán con el cliente DIO (HTTP).
